tap "homebrew/bundle"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cross-shell prompt for astronauts
brew "starship"
# Internet file retriever
brew "wget"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# GPU-accelerated terminal emulator
cask "alacritty"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Remove junk and unused files
cask "ccleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-alegreya-sans"
cask "font-anonymice-nerd-font"
cask "font-anton"
cask "font-architects-daughter"
cask "font-arimo"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-be-vietnam-pro"
cask "font-bebas-neue"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-chakra-petch"
cask "font-code-new-roman-nerd-font"
cask "font-comfortaa"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dancing-script"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-dm-sans"
cask "font-dosis"
cask "font-droid-sans-mono-nerd-font"
cask "font-exo-2"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-figtree"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-gloria-hallelujah"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-great-vibes"
cask "font-gruppo"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-homemade-apple"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-indie-flower"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-josefin-sans"
cask "font-jost"
cask "font-kalam"
cask "font-kanit"
cask "font-lato"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-maven-pro"
cask "font-merriweather"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-montserrat"
cask "font-montserrat-alternates"
cask "font-mplus-nerd-font"
cask "font-nanum-gothic"
cask "font-noto-nerd-font"
cask "font-nunito"
cask "font-open-dyslexic-nerd-font"
cask "font-open-sans"
cask "font-orbitron"
cask "font-oswald"
cask "font-outfit"
cask "font-overpass-nerd-font"
cask "font-oxygen"
cask "font-play"
cask "font-playfair-display"
cask "font-playwrite-au-qld"
cask "font-playwrite-au-sa"
cask "font-poppins"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-pt-sans"
cask "font-questrial"
cask "font-quicksand"
cask "font-rajdhani"
cask "font-raleway"
cask "font-red-hat-display"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-roboto-slab"
cask "font-rock-salt"
cask "font-sacramento"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-grotesk"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-tiny5"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-urbanist"
cask "font-victor-mono-nerd-font"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Vector graphics editor
cask "inkscape"
# Open-source screen recorder built with web technology
cask "kap"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Document editor
cask "onlyoffice"
# Retro video game emulation
cask "openemu"
# Replacement for Docker Desktop
cask "orbstack"
# G-code generator for 3D printers
cask "orcaslicer"
# Collaboration platform for API development
cask "postman"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Design and collaborate in 3D
cask "spline"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
